{
  "Navbar": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "contact": "Contact",
    "language": "Spanish",
    "locale": "es"
  },
  "Home": {
    "title": "Are you looking for your next awesome web app?",
    "button": "I am"
  },
  "About": {
    "title": "Hey!, nice to meet you, I am a Full-stack and DevOps developer who hopes to help you with your next challenge. Feel free to reach out to me via GitHub or LinkedIn.",
    "about1": "Over the past several years, I've gained hands-on experience both as a freelance developer and as an employee, delivering end-to-end solutions across a wide range of clients, teams, and industries. These roles have sharpened my ability to adapt quickly, communicate effectively, and build scalable, production-ready applications.",
    "about2": "On the frontend, I specialize in React, Next.js, and Remix.run, often working with Vite and TailwindCSS to deliver fast, responsive interfaces. I frequently use Redux for state management and Jest for testing. I've also used platforms like WordPress and Zoho Sites to build landing pages or AI-driven experiences.",
    "about3": "On the backend, I've developed APIs using TypeScript with Express.js and NestJS (with or without Prisma), Python with FastAPI, Django, and Flask, PHP (native), and C# with ASP.NET. I'm confident working with SQL and NoSQL databases, including MySQL, PostgreSQL, SQLite, MongoDB, and Firebase.",
    "about4": "As part of my DevOps skill set, I've deployed and managed applications across major cloud platforms such as AWS (Lightsail, S3 Bucket, RDS, Route 53), Azure, and Google Cloud Platform. I regularly use Docker for containerization, GitHub Actions for CI/CD workflows, and platforms like Vercel, Render, Fly.io, Supabase, and AppWrite for hosting. I also integrate third-party tools including Resend, EmailJS, Make, Zapier, and the Zoho suite (Deluge, CRM, Creator, Flow).",
    "prebutton": "But don't take my word for it...",
    "button": "See my projects"
  },
  "Projects": {
    "lan": "en",
    "title": "Did you like them?",
    "button": "Contact me!"
  },
  "Collaborations": {
    "lan": "en",
    "title": "Collaborations"
  },
  "Contact": {
    "title": "Let's build something great together!",
    "name": "Name",
    "email": "E-mail",
    "message": "Message",
    "button": "Send",
    "successEmail": "Your email has been sent successfully!",
    "secondSuccessEmail": "I will contact you as soon as possible.",
    "errorEmail": "There was an error sending your email, please try again later.",
    "secondErrorEmail": "If the problem persists, ",
    "emailForProblems": "please contact me."
  },
  "Footer": {
    "rights": "All rights reserved."
  }
}
