{
  "Navbar": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "contact": "Contact",
    "language": "Spanish",
    "locale": "es"
  },
  "Home": {
    "title": "Are you looking for your next awesome web app?",
    "button": "I am"
  },
  "About": {
    "title": "Hey!, nice to meet you, I am a full-stack developer who hopes to help you in your next challenge. Feel free to reach out to me via GitHub or LinkedIn.",
    "about1": "During the course of my degree studies in Information Technology at the Tecnológico de Monterrey, I have engaged with various technologies. However, my particular enthusiasm lies in web development, where I have gained proficiency in utilizing diverse frameworks such as React with Vite (frontend dev tool), Remix.run, and Next.js for frontend development. Additionally, I have gained hands-on experience with additional technologies, including Astro for personal projects, as well as proficiency in utlizing Wordpress and Zoho Sites for the development of landing pages or using artificial intelligence to offer innovative solutions.",
    "about2": "Moreover, I possess expertise in working with other programming languages, such as Python, where i have utilized framworks like Flask and FastAPI or Typescript with NestJS using Prisma as an ORM. Futhermore, I have employed PHP for the development of APIs, seamlessly integrating databases in MySQL, PostgreSQL, and MongoDB.",
    "about3": "Lastly, I also have experience with cloud services for hosting web applications, databases and third party products. Some of the technologies or services I am familiar with include Fly.io, Render, Vercel, Azure, Docker Hub, Google Cloud Console, AppWrite, Supabase, Resend, EmailJS, Make, Zapier, Zoho products such as Deluge, CRM, Creator, and Flow; and AWS services such as Lightsail, S3 Bucket, RDS, and Route 53",
    "about4": "This diversified skill set underscores my commitment to staying abreast of cutting-edge technologies and my ability to adpat to vaious development environments.",
    "prebutton": "But don't take my word for it...",
    "button": "See my projects"
  },
  "Projects": {
    "lan": "en",
    "title": "Did you like them?",
    "button": "Contact me!"
  },
  "Contact": {
    "title": "Let's build something great together!",
    "name": "Name",
    "email": "E-mail",
    "message": "Message",
    "button": "Send",
    "successEmail": "Your email has been sent successfully!",
    "secondSuccessEmail": "I will contact you as soon as possible.",
    "errorEmail": "There was an error sending your email, please try again later.",
    "secondErrorEmail": "If the problem persists, ",
    "emailForProblems": "please contact me."
  },
  "Footer": {
    "rights": "All rights reserved."
  }
}
