{
  "Navbar": {
    "home": "Inicio",
    "about": "Información",
    "projects": "Proyectos",
    "contact": "Contacto",
    "language": "Inglés",
    "locale": "en"
  },
  "Home": {
    "title": "¿Estás en busca de tu próxima aplicación web increíble?",
    "button": "¡Vamos!"
  },
  "About": {
    "title": "¡Hola!, mucho gusto, soy un desarrollador Full-stack y DevOps que espera ayudarte con tu próximo desafío. Siéntente libre de conectarte conmigo a través de GitHub o LinkedIn.",
    "about1": "A lo largo de los últimos años, he adquirido experiencia práctica tanto como desarrollador freelance como empleado, entregando soluciones de extremo a extremo para una amplia variedad de clientes, equipos e industrias. Estos roles han fortalecido mi capacidad para adaptarme rápidamente, comunicarme de manera efectiva y construir aplicaciones escalables listas para producción.",
    "about2": "En el frontend, me especializo en React, Next.js y Remix.run, trabajando frecuentemente con Vite y TailwindCSS para ofrecer interfaces rápidas y responsivas. Utilizo Redux para la gestión de estado y Jest para pruebas. También he trabajado con plataformas como WordPress y Zoho Sites para crear landing pages o experiencias impulsadas por inteligencia artificial.",
    "about3": "En el backend, he desarrollado APIs utilizando TypeScript con Express.js y NestJS (con o sin Prisma), Python con FastAPI, Django y Flask, PHP (nativo) y C# con ASP.NET. Me siento cómodo trabajando con bases de datos SQL y NoSQL, incluyendo MySQL, PostgreSQL, SQLite, MongoDB y Firebase.",
    "about4": "Como parte de mi experiencia en DevOps, he desplegado y gestionado aplicaciones en las principales plataformas en la nube como AWS (Lightsail, S3 Bucket, RDS, Route 53), Azure y Google Cloud Platform. Utilizo regularmente Docker para la contenerización, GitHub Actions para flujos de trabajo CI/CD y plataformas como Vercel, Render, Fly.io, Supabase y AppWrite para el hosting. También integro herramientas de terceros como Resend, EmailJS, Make, Zapier y la suite de Zoho (Deluge, CRM, Creator, Flow).",
    "prebutton": "Pero no te quedes con mis palabras...",
    "button": "Conoce mis proyectos"
  },
  "Projects": {
    "lan": "es",
    "title": "¿Te gustó lo que viste?",
    "button": "Escríbeme!"
  },
  "Collaborations": {
    "lan": "es",
    "title": "Colaboraciones"
  },
  "Contact": {
    "title": "¡Hagamos algo increíble juntos!",
    "name": "Nombre",
    "email": "Correo electrónico",
    "message": "Mensaje",
    "button": "Enviar",
    "successEmail": "Se ha enviado tu correo exitosamente!",
    "secondSuccessEmail": "Te contactaré lo más pronto posible.",
    "errorEmail": "Ha ocurrido un error al enviar tu correo.",
    "secondErrorEmail": "Si el problema persiste, ",
    "emailForProblems": "Por favor envíame un correo."
  },
  "Footer": {
    "rights": "Todos los derechos reservados."
  }
}
