{
  "Navbar": {
    "home": "Inicio",
    "about": "Información",
    "projects": "Proyectos",
    "contact": "Contacto",
    "language": "Inglés",
    "locale": "en"
  },
  "Home": {
    "title": "¿Estás en busca de tu próxima aplicación web increíble?",
    "button": "¡Vamos!"
  },
  "About": {
    "title": "¡Hola!, mucho gusto, soy un desarrollador full-stack que espera ayudarte con tu próximo desafío. Siéntente libre de conectarte conmigo a través de GitHub o LinkedIn.",
    "about1": "A lo largo de mi carrera de Ingeniería en Tecnologías Computacionales en el Tecnológico de Monterrey, me he involucrado con diversas tecnologías. Sin embargo, mi favorita es el desarrollo web, donde he adquirido bastante experiencia en el uso de diversos frameworks para el frontend como React con Vite (Herramienta de desarrollo frontend), Remix.run y Next.js. Además, también he adquirido experiencia con tecnologías adicionales como lo son Astro para proyectos personales, así como también el uso de Wordpress y Zoho Sites para el desarrollo de páginas estáticas o el uso de inteligencia artificial para ofrecer soluciones innovadoras.",
    "about2": "Por otro lado, cuento con experiencia al haber trabajado con otros lenguajes de programación como lo son Python, donde he utilizado frameworks/librerías  como Flask y FastAPI, o Typescript con NestJS usando Prisma como ORM. A su vez, también he trabajado con PHP para el desarrollo de APIs, integrando perfectamente bases de datos en MySQL, PostgreSQL y MongoDB.",
    "about3": "Por último, también tengo experiencia con servicios en la nube para alojamiento de aplicaciones web, bases de datos o productos de terceros. Algunas de las tecnologías o servicios con los que estoy familiarizado incluyen Fly.io, Render, Vercel, Azure, Docker Hub, Google Cloud Console, AppWrite, Supabase, Resend, EmailJS, Make, Zapier, productos de Zoho como Deluge, CRM, Creator y Flow; y servicios de AWS como Lightsail, S3 Bucket, RDS y Route 53.",
    "about4": "Toda esta experiencia y conocimiento respalda mi compromiso de mantenerme al tanto de las tecnologías de vanguardia y mi capacidad para adaptarme a diversos entornos de desarrollo.",
    "prebutton": "Pero no te quedes con mis palabras...",
    "button": "Conoce mis proyectos"
  },
  "Projects": {
    "lan": "es",
    "title": "¿Te gustó lo que viste?",
    "button": "Escríbeme!"
  },
  "Collaborations": {
    "lan": "es",
    "title": "Colaboraciones"
  },
  "Contact": {
    "title": "¡Hagamos algo increíble juntos!",
    "name": "Nombre",
    "email": "Correo electrónico",
    "message": "Mensaje",
    "button": "Enviar",
    "successEmail": "Se ha enviado tu correo exitosamente!",
    "secondSuccessEmail": "Te contactaré lo más pronto posible.",
    "errorEmail": "Ha ocurrido un error al enviar tu correo.",
    "secondErrorEmail": "Si el problema persiste, ",
    "emailForProblems": "Por favor envíame un correo."
  },
  "Footer": {
    "rights": "Todos los derechos reservados."
  }
}
